app/views/users/likes.html.erb

<% @likes.each do |like| %>
<% picture = Picture.find_by(id: like.picture_id) %>
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]