app/views/users/show.html.erb

SELECT "pictures".* FROM "pictures" WHERE "pictures"."user_id" = ?  [["user_id", 2]]
---
        <div class="columns is-multiline"> <%# 画像欄 %>
            <% @user.pictures.each do |picture| %>