app/views/pictures/show.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."picture_id" = ? LIMIT ?  [["user_id", 2], ["picture_id", 1], ["LIMIT", 1]]
---
                            <% end %>
                            <% if Like.find_by(user_id: current_user.id, picture_id: @picture.id) %> <%# お気に入り機能%>