app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "picture_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["picture_id", 1], ["created_at", "2021-02-23 14:48:17.646213"], ["updated_at", "2021-02-23 14:48:17.646213"]]
---
    def create
        @like = current_user.likes.create(picture_id: params[:picture_id])

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."picture_id" = ? LIMIT ?  [["user_id", 3], ["picture_id", 2], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 9]]
---
    def destroy
        @picture = Picture.find(params[:picture_id])
        @like = current_user.likes.find_by(picture_id: @picture.id)
        @like.destroy