app/controllers/pictures_controller.rb

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @picture = Picture.find_by(id: params[:id])
    @user = @picture.user
    @tags = ActsAsTaggableOn::Tag.find(params[:id])