app/controllers/pictures_controller.rb

  def index
    @pictures = Picture.all.order(created_at: :desc)
    @picture = Picture.find_by(id: params[:id])
---
SELECT "pictures".* FROM "pictures" ORDER BY "pictures"."created_at" DESC
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" IS NULL LIMIT ?  [["LIMIT", 1]]

  def show
    @picture = Picture.find_by(id: params[:id])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @picture = current_user.pictures.build(picture_params)
    if @picture.save
---
INSERT INTO "pictures" ("user_id", "title", "body", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def edit
    @picture = Picture.find(params[:id])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @picture = Picture.find(params[:id])
    if @picture.update(picture_params)
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "pictures" SET "image_id" = ?, "updated_at" = ? WHERE "pictures"."id" = ?  [["image_id", "49892ab75cc51c16053953019cee2317cffbb120e32a9ed64186969808b0"], ["updated_at", "2021-02-24 06:04:31.617135"], ["id", 2]]

  def destroy
    @picture = Picture.find_by(id: params[:id])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]