app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "email" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "hanana"], ["email", "hanaa@mma"], ["profile_image_id", "a7f6fcc8d43ec1734958cdf1fbfec44007d62e827d7ae7dde60ff291afad"], ["updated_at", "2021-03-11 05:22:23.902062"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 2]]
---
  def likes
    @user = User.find_by(id: params[:id])
    @likes = Like.where(user_id: @user.id)