app/models/picture.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def user
        return User.find_by(id: self.user_id)